tap "homebrew/bundle"
# Tool for exploring each layer in a docker image
brew "dive"
# HTTP and gRPC load testing and visualization tool and server
brew "fortio"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Port scanning utility for large networks
brew "nmap"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Chromium based browser
cask "arc"
# Two-factor authentication software
cask "authy"
# Calendar for professionals and teams
cask "cron"
# Data recovery software
cask "disk-drill"
# Online diagram software
cask "drawio"
# Web browser
cask "firefox"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Interface for reading and syncing eBooks
cask "kindle"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# App to write, plan, collaborate, and get organized
cask "notion"
# Calculator and converter application
cask "numi"
# Replacement for Docker Desktop
cask "orbstack"
# Screen capture tool with mark up and sharing features
cask "skitch"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
vscode "adpyke.codesnap"
vscode "akamud.vscode-theme-onedark"
vscode "buenon.scratchpads"
vscode "Casbin.vscode-casbin"
vscode "cweijan.onedark-modern"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "foxundermoon.shell-format"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "jeffersonlicet.snipped"
vscode "Markwhen.markwhen"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nopeslide.vscode-drawio-plugin-mermaid"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "tldraw-org.tldraw-vscode"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
