tap "homebrew/bundle"
brew "git"
brew "gnupg"
brew "go"
brew "htop"
brew "python@3.11"
brew "tree"
brew "zsh-autosuggestions"
cask "arc"
cask "authy"
cask "disk-drill"
cask "drawio"
cask "firefox"
cask "iterm2"
cask "kindle"
cask "microsoft-teams"
cask "notion"
cask "numi"
cask "orbstack"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
cask "zoom"
