tap "homebrew/bundle"
# Distributed revision control system
brew "ctop"
brew "dive"
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "krew"

# Interpreted, interactive, object-oriented programming language
brew "openjdk"
brew "openjdk@11"
brew "python@3.11"
# Display directories as trees (with optional color/HTML output)
brew "tree"
brew "watch"
brew "yq"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Chromium based browser
cask "arc"
# Two-factor authentication software
cask "authy"
# Data recovery software
cask "disk-drill"
# Online diagram software
cask "drawio"
# Web browser
cask "firefox"
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Interface for reading and syncing eBooks
cask "kindle"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# App to write, plan, collaborate, and get organized
cask "notion"
# Calculator and converter application
cask "numi"
cask "orbstack"
# Screen capture tool with mark up and sharing features
cask "skitch"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
vscode "adpyke.codesnap"
vscode "akamud.vscode-theme-onedark"
vscode "buenon.scratchpads"
vscode "casbin.vscode-casbin"
vscode "cweijan.onedark-modern"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "foxundermoon.shell-format"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "jeffersonlicet.snipped"
vscode "markwhen.markwhen"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nopeslide.vscode-drawio-plugin-mermaid"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "tldraw-org.tldraw-vscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
